[
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
        "name": "Keep Smile",
        "img":"https://i.ibb.co/9yt156v/Screenshot-2023-06-28-021629.png",
        "img_url": "https://i.ibb.co/NjHBRHS/If-You-Cant-Get-a-Doctors-Appointment.jpg",
        "details":"Welcome to my Keep smile, a Teeth Dental Appointment Booking Website. This project showcases my skills in developing a full-stack web application using the MERN (MongoDB, Express.js, React.js, Node.js) stack. The website provides a user-friendly interface for patients to book dental appointments, manage appointments, make payments securely through Stripe, and access various administrative functionalities.",
        "description": "",
        "site":"Mern stack Project",
        "role": "best website",
        "item": "User Registration and Login: Users can create an account by registering with their email and password. Once registered, they can log in securely to access the website's features.",
        "item1": "Appointment Booking: After logging in, users are directed to the Appointment page. They can select from different categories such as Routine Check-up, Teeth Whitening, Dental Fillings, Orthodontics, Dental Surgery, and Cosmetic Dentistry. Users can choose their desired category and select an available date and time slot for their appointment.",
        "item2" : "Dashboard: Upon successful appointment booking, users are redirected to their personalized dashboard. Here, they can view their upcoming appointments, including relevant details such as the appointment date, time, and the assigned dental professional.",
        "item3" : "Payment: If required, users can proceed to make payment for their appointment through the integrated Stripe payment gateway. The website ensures a secure and seamless payment process, allowing users to use any major credit or debit card.",
        "item4" : "User Management: The website includes an admin panel where authorized users have administrative privileges. Admins can manage general users, granting them admin status or deleting their accounts to maintain the integrity and security of the platform.",
        "item5" : "Doctor Management: Admins can add new doctors to the system through the 'Add a Doctor' functionality. They can input details such as the doctor's name, specialization, and contact information. The website also provides a 'Manage Doctor' route, displaying all doctors within the system.",
        "item6" : "Login and Signup: To ensure secure access and protect user information, the website features a robust authentication system. Users can create an account by signing up with their email and password. Upon successful registration, they can log in securely.",
        "uses": "Html, Css, Tailwind Css, Javascript, react Js, react router dom, swiper Js, express Js, firebase, mongodb, stripe, jsonwebtoken, dotenv, firebase, render etc.",
        "link": "https://doctor-appointments-7e34b.web.app/",
        "client_side": "https://github.com/JintuPaul/doctors-appointment-client-side",
        "server_side": "https://github.com/JintuPaul/doctors-appointment-server"
    },
      {
        "_id": "0282e0e58a5c404fbd15261f11c2ab7b",
        "name": "Travel Xone",
          "img": "https://i.ibb.co/3TyNSc3/Screenshot-2023-05-21-015410.png",
          "img_url":"https://www.state.gov/wp-content/uploads/2020/11/shutterstock_186964970-scaled.jpg",
          "details":"this website is made by me and five other people. this website a travel xone website. where a travel lover can enjoy many benefits. i worked on the frontend part of this website.",
          "description": "",
          "site":"Full Stack Project",
          "role": "best website",
          "item": "Travel Xone this website is our team project with coding done by six developers.",
          "item1": "this website shows various places of interest in bangladesh, and there are details of the place.",
          "item2" : "You must login to get to view all types of futures.",
          "item3" : "By using this website you can book the hotel in that place.",
          "uses": "html, css, tailwind, javascript, Next.js, swiper.js, react router dom, express, firebase, nodeJs, mongose",
          "link": "https://travel-xone-2023.vercel.app/",
          "client_side": "https://github.com/Johirul-islam-6/travel-xone-client",
          "server_side": "https://github.com/RidoyMia/travel-xone-server"
  
      },
      {
        "_id": "0282e0e58a5c404fbd15261f11c2ab6abb",
          "name": "Food delivery website",
          "img": "https://i.ibb.co/fqQY2S7/Screenshot-2023-10-18-012617.png",
          "img_url":"https://i.ibb.co/Jq7yLyS/New-Project.png",
          "details":"this website is an e mobile phone e commerce website. this website has phones according to different categories from where any buyer can order phones according to his choice.there are seven categories of phones . first, the products of the new collection are shown in the next one apple, vivo, samnsung, xaiomi, oppo and htc are shown and each category, there are sub categories of that category. form where it can be easily purchased.",
          "description": "",
          "site":"Mern stack Project",
          "role": "good website",
          "item": "there are many types of category of Food.",
          "item1": "You can buy food as per your wish.",
          "item2" : "You must login to purchase food.",
          "item3" : "if you click on the food cards on the home page, you can see the details of the product, and from there you can click on buy now button to purchase.",
          "uses": "Html, Css, Tailwind Css, Javascript, react Js, swiper Js, express Js, firebase, MongoDb",
          "link": "https://food-delivery-24cd0.web.app/",
          "client_side": "https://github.com/jintu25/food-delivery-client",
          "server_side": "https://github.com/jintu25/food-delivery-server"
      }
    ]